4ms/stm32mp1-baremetal/ctest/Drivers/BSP/STM32MP15xx_EVAL/stm32mp15xx_eval_stpmic1.c
uint16_t ldo6_voltage_table[] = {
  900, // 0,9
  1000, // 1,0
  1100, // 1,1
  1200, // 1,2
  1300, // 1,3
  1400, // 1,4
  1500, // 1,5
  1600, // 1,6
  1700, // 1,7
  1800, // 1,8
  1900, // 1,9
  2000, // 2
  2100, // 2,1
  2200, // 2,2
  2300, // 2,3
  2400, // 2,4
  2500, // 2,5
  2600, // 2,6
  2700, // 2,7
  2800, // 2,8
  2900, // 2,9
  3000, // 3
  3100, // 3,1
  3200, // 3,2
  3300, // 3,3
};


uint16_t ldo4_voltage_table[] = {
  3300, // 3,3
};

uint16_t vref_ddr_voltage_table[] = {
  3300, // 3,3
};

/*
  Table of Regulators in PMIC SoC
*/



regul_struct regulators_table[] = {
    {
      .id       = STPMU1_BUCK1,
      .voltage_table   = buck1_voltage_table,
      .voltage_table_size = ARRAY_SIZE(buck1_voltage_table),
      .control_reg   = BUCK1_CONTROL_REG,
      .low_power_reg   = BUCK1_PWRCTRL_REG,
      .rank      = OTP_RANK_BUCK1,
    },
    {
      .id       = STPMU1_BUCK2,
      .voltage_table   = buck2_voltage_table,
      .voltage_table_size = ARRAY_SIZE(buck2_voltage_table),
      .control_reg   = BUCK2_CONTROL_REG,
      .low_power_reg   = BUCK2_PWRCTRL_REG,
      .rank      = OTP_RANK_BUCK2,
    },
    {
      .id       = STPMU1_BUCK3,
      .voltage_table   = buck3_voltage_table,
      .voltage_table_size = ARRAY_SIZE(buck3_voltage_table),
      .control_reg   = BUCK3_CONTROL_REG,
      .low_power_reg   = BUCK3_PWRCTRL_REG,
      .rank      = OTP_RANK_BUCK3,
    },
    {
      .id       = STPMU1_BUCK4,
      .voltage_table   = buck4_voltage_table,
      .voltage_table_size = ARRAY_SIZE(buck4_voltage_table),
      .control_reg   = BUCK4_CONTROL_REG,
      .low_power_reg   = BUCK4_PWRCTRL_REG,
      .rank      = OTP_RANK_BUCK4,
    },
    {
      .id       = STPMU1_LDO1,
      .voltage_table   = ldo1_voltage_table,
      .voltage_table_size = ARRAY_SIZE(ldo1_voltage_table),
      .control_reg   = LDO1_CONTROL_REG,
      .low_power_reg   = LDO1_PWRCTRL_REG,
      .rank      = OTP_RANK_LDO1,
    },
    {
      .id       = STPMU1_LDO2,
      .voltage_table   = ldo2_voltage_table,
      .voltage_table_size = ARRAY_SIZE(ldo2_voltage_table),
      .control_reg   = LDO2_CONTROL_REG,
      .low_power_reg   = LDO2_PWRCTRL_REG,
      .rank      = OTP_RANK_LDO2,
    },

    {
      .id       = STPMU1_LDO3,
      .voltage_table   = ldo3_voltage_table,
      .voltage_table_size = ARRAY_SIZE(ldo3_voltage_table),
      .control_reg   = LDO3_CONTROL_REG,
      .low_power_reg   = LDO3_PWRCTRL_REG,
      .rank      = OTP_RANK_LDO3,
    },
    {
      .id       = STPMU1_LDO4,
      .voltage_table   = ldo4_voltage_table,
      .voltage_table_size = ARRAY_SIZE(ldo4_voltage_table),
      .control_reg   = LDO4_CONTROL_REG,
      .low_power_reg   = LDO4_PWRCTRL_REG,
      .rank      = OTP_RANK_LDO4,
    },
    {
      .id       = STPMU1_LDO5,
      .voltage_table   = ldo5_voltage_table ,
      .voltage_table_size = ARRAY_SIZE(ldo5_voltage_table),
      .control_reg   = LDO5_CONTROL_REG,
      .low_power_reg   = LDO5_PWRCTRL_REG,
      .rank      = OTP_RANK_LDO5,
    },
    {
      .id       = STPMU1_LDO6,
      .voltage_table   = ldo6_voltage_table ,
      .voltage_table_size = ARRAY_SIZE(ldo6_voltage_table),
      .control_reg   = LDO6_CONTROL_REG,
      .low_power_reg   = LDO6_PWRCTRL_REG,
      .rank      = OTP_RANK_LDO6,
    },
    {
      .id       = STPMU1_VREFDDR,
      .voltage_table   = vref_ddr_voltage_table ,
      .voltage_table_size = ARRAY_SIZE(vref_ddr_voltage_table),
      .control_reg   = VREF_DDR_CONTROL_REG,
      .low_power_reg   = VREF_DDR_PWRCTRL_REG,
      .rank      = OTP_RANK_VREFDDR,
    },
};

#define MAX_REGUL  ARRAY_SIZE(regulators_table)

 /**
  * @}
  */ 
  
/** @defgroup STM32MP15XX_EVAL_STPMU_Private_Functions Private Functionss
  * @{
  */
  
/* Private function prototypes -----------------------------------------------*/
void STPMU1_IrqHandler(void);
void STPMU1_INTn_Callback(PMIC_IRQn IRQn);
static void My_Error_Handler(void);
static regul_struct *STPMU1_Get_Regulator_Data(PMIC_RegulId_TypeDef id);
static uint8_t STPMU1_Voltage_Find_Index(PMIC_RegulId_TypeDef id, uint16_t milivolts);

/* Private functions ---------------------------------------------------------*/


static regul_struct *STPMU1_Get_Regulator_Data(PMIC_RegulId_TypeDef id)
{
  uint8_t i ;

  for (i = 0 ; i < MAX_REGUL ; i++ )
  {
    if (id == regulators_table[i].id)
      return &regulators_table[i];
  }
  /* id not found */
  My_Error_Handler();
  return NULL;
}

static uint8_t STPMU1_Voltage_Find_Index(PMIC_RegulId_TypeDef id, uint16_t milivolts)
{
  regul_struct *regul = STPMU1_Get_Regulator_Data(id);
  uint8_t i;
  for ( i = 0 ; i < regul->voltage_table_size ; i++)
  {
    if ( regul->voltage_table[i] == milivolts ) {
      //printf("idx:%d for %dmV\n\r", (int)i, (int)milivolts);
      return i;
    }
  }
  /* voltage not found */
  My_Error_Handler();
  return 0;
}

void STPMU1_Enable_Interrupt(PMIC_IRQn IRQn)
{
  uint8_t irq_reg , irq_reg_value ;

  if (IRQn >= IRQ_NR)
    return ;

  /* IRQ register is IRQ Number divided by 8 */
  irq_reg = IRQn >> 3 ;

  /* value to be set in IRQ register corresponds to BIT(7-N) where N is the Interrupt id modulo 8 */
  irq_reg_value = 1 << ( 7 - ( IRQn%8 ) );

  /* Clear previous event stored in latch */
  STPMU1_Register_Write(ITCLEARLATCH1_REG+irq_reg, irq_reg_value );

  /* Clear relevant mask to enable interrupt */
  STPMU1_Register_Write(ITCLEARMASK1_REG+irq_reg, irq_reg_value );

}

extern void STPMU1_Disable_Interrupt(PMIC_IRQn IRQn)
{
  uint8_t irq_reg , irq_reg_value ;

  if (IRQn >= IRQ_NR)
    return ;

  /* IRQ register is IRQ Number divided by 8 */
  irq_reg = IRQn >> 3 ;

  /* value to be set in IRQ register corresponds to BIT(7-N) where N is the Interrupt id modulo 8 */
  irq_reg_value = 1 << ( 7 - ( IRQn%8 ) );

  /* Clear previous event stored in latch */
  STPMU1_Register_Write(ITCLEARLATCH1_REG+irq_reg, irq_reg_value );

  /* Set relevant mask to disable interrupt */
  STPMU1_Register_Write(ITSETMASK1_REG+irq_reg, irq_reg_value );

